Tekla.Structures.Dialog.UIControls.ComponentCatalogForm
The ComponentCatalogForm class represents a form for selecting component catalog items.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.COMPONENTCATALOGFILE
Catalog file.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.COMPONENTCATALOGTREEVIEWFILE
Catalog tree file.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.SYSTEMBASICSCOMPONENTSFILESD
Catalog basic file for steel.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.SYSTEMBASICSCOMPONENTSFILECD
Catalog basic file for concrete.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.SYSTEMBASICSCOMPONENTSFILEFD
Catalog basic file for full.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.BASICSTRING
Basic string.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.COLLECTIONSTRING
Collection string.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.COMPONENTSTRING
Component string.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.selectedName
Selected component name.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.selectedNumber
Selected component number.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.connectionImage
Connection image.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.customConnectionImage
Custom connection image.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.detailImage
Detail image.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.customDetailImage
CustomDetail image.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.objectImage
Object image.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.customObjectImage
Customobject image.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.componentImage
Component image.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.customComponentImage
Custom component image.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.partImage
Part image.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.customPartImage
Custom part image.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.#ctor
Initializes a new instance of the ComponentCatalogForm class.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.OnLoad(System.EventArgs)
When the load event is raised, the tree in the dialog is filled with the components.
The create dialog is only localized when it is not in design mode,
meaning it is shown without localization in Visual Studio.
eventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.InitializeImages
Initialize images.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.FillCollectionBoxStandardItems
Initialize combobox.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.ReadCatalogBasicFilesAndAddToCollection
Read catalog basic files and add to collections.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.ReadCatalogFilesAndUpdateCollectionBox
Read catalog file and add to collections.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.CreateNode(System.String)
Create node.
nodeString: Node string.
Returns: Treenode if item added successfully.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.CreateTreeNode(System.Windows.Forms.TreeNode,System.String)
Create node to catalog tree.
fatherNode: Father node.
nodeString: Node string.
Returns: Treenode if item added successfully.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.ReadTreeFilesAndFillComponentTree
Read catalog tree file, create tree and add to collections.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.AdjustComponentDataGridColumns
Create image column to component datagrid and organize information in the grid.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.RefreshComponentGridView
Refresh component datagrid to show correct datasource.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.ComponentCatalogForm_Shown(System.Object,System.EventArgs)
Form showed.
sender: Event sender.
e: Event arguments.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.CollectionBox_SelectedIndexChanged(System.Object,System.EventArgs)
Collection changed.
sender: Event sender.
e: Event arguments.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.SearchButton_Click(System.Object,System.EventArgs)
Search button clicked.
sender: Event sender.
e: Event arguments.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.SearchTextBox_TextChanged(System.Object,System.EventArgs)
Search field text changed.
sender: Event sender.
e: Event arguments.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.ComponentTreeView_AfterSelect(System.Object,System.Windows.Forms.TreeViewEventArgs)
Node in component tree selected.
sender: Event sender.
e: Event arguments.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.ChangeViewBetweenCollectionAndTree
Collection or component tree view changed.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.CollectionToolStripButton_Click(System.Object,System.EventArgs)
Collection view changed.
sender: Event sender.
e: Event arguments.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.TreeToolStripButton_Click(System.Object,System.EventArgs)
Component tree view changed.
sender: Event sender.
e: Event arguments.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.ComponentGridView_CellFormatting(System.Object,System.Windows.Forms.DataGridViewCellFormattingEventArgs)
Datagrid cell formatting. Imagevalue set based on type
sender: Event sender.
e: Event arguments.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.OkCancel1_OkClicked(System.Object,System.EventArgs)
Ok clicked.
sender: Event sender.
e: Event arguments.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.SelectedName
Gets the selected component name.

Tekla.Structures.Dialog.UIControls.ComponentCatalogForm.SelectedNumber
Gets the selected component number.